{
    "id": "api_startlastmileprobetest",
    "name": "startLastmileProbeTest",
    "description": "Starts the last mile network probe test.Since\n                    v2.4.0\n                \n            \n            This method starts the last-mile network probe test before joining a channel to get the uplink and downlink last mile network statistics, including the bandwidth, packet loss, jitter, and round-trip time (RTT).\n            Once this method is enabled, the SDK returns the following callbacks:\n                    LASTMILE_QUALITY: The SDK triggers this callback within two seconds depending on the network conditions. This callback rates the network conditions and is more closely linked to the user experience.\n                    LASTMILE_PROBE_RESULT: The SDK triggers this callback within 30 seconds depending on the network conditions. This callback returns the real-time statistics of the network conditions and is more objective.\n                \n            \n            This method applies to the following scenarios:\n                    Before a user joins a channel, call this method to check the uplink network quality.\n                    In a live streaming channel, call this method to check the uplink network quality before an audience member switches to a host.\n                \n            \n            \n                \n                    This method consumes extra network traffic and may affect communication quality. We do not recommend calling this method and enableLastmileTest at the same time.\n                    Do not call other methods before receiving the LASTMILE_QUALITY and LASTMILE_PROBE_RESULT callbacks. Otherwise, the callbacks may be interrupted.\n                    A host should not call this method after joining a channel (when in a call).",
    "parameters": [
        {
            "config": "The configurations of the last-mile network probe test: LastmileProbeConfig."
        }
    ],
    "returns": "0: Success.\n                < 0: Failure."
}