{
    "id": "api_joinchannel2",
    "name": "joinChannel",
    "description": "Joins a channel with the user ID, and configures whether to automatically subscribe to the audio or video streams.Since\n  v3.3.0\n       \n   \n            This method joins an Agora RTC channel. Users with the same App ID in the same channel can talk to each other, and multiple users in the same channel can start a group chat.\n            A successful call of this method triggers the following callbacks:\n                The local client: The JOINED_CHANNEL and CONNECTION_STATE_CHANGED callbacks.\n                The remote client: USER_JOINED, if the user joining the channel is in the communication profile, or is a host in the live streaming profile.\n            \n            When the connection between the client and Agora's server is interrupted due to poor network conditions, the SDK tries reconnecting to the server. When the local client successfully rejoins the channel, the SDK triggers the REJOIN_CHANNEL_SUCCESS callback on the local client.",
    "parameters": [
        {
            "token": "\n    The token generated on your server for authentication. See Authenticate Your Users with Token.\n    Ensure that the App ID used for creating the token is the same App ID used by the initializeWithContext method for initializing the RTC engine.\n      "
        },
        {
            "channelId": "\n      The name of the channel. This parameter signifies the channel in which users engage in real-time audio and video interaction. Under the premise of the same App ID, users who fill in the same channel name enter the same channel for audio and video interaction. The string length must be less than 64 bytes. Supported characters:\n     All lowercase English letters: a to z.\n     All uppercase English letters: A to Z.\n     All numeric characters: 0 to 9.\n     Space\n     \"!\"、\"#\"、\"$\"、\"%\"、\"&\"、\"(\"、\")\"、\"+\"、\"-\"、\":\"、\";\"、\"<\"、\"=\"、\".\"、\">\"、\"?\"、\"@\"、\"[\"、\"]\"、\"^\"、\"_\"、\"{\"、\"}\"、\"|\"、\"~\"、\",\"\n \n  "
        },
        {
            "info": "\n      Reserved for future use.\n  "
        },
        {
            "uid": "User ID. This parameter is used to identify the user in the channel for real-time audio and video interaction. You need to set and manage user IDs yourself, and ensure that each user ID in the same channel is unique. A 32-bit unsigned integer with a value ranging from 1 to 232-1. If the user ID is not assigned (or set to 0), the SDK assigns and returns a user ID in the JOINED_CHANNEL callback. Your application must record and maintain the returned user ID, because the SDK does not do so."
        },
        {
            "options": "The channel media options. See ChannelMediaOptions."
        }
    ],
    "returns": "0(ERR_OK): Success.\n       < 0: Failure.\n  -2 (ERR_INVALID_ARGUMENT): The parameter is invalid.\n  -3(ERR_NOT_READY): The SDK fails to be initialized. You can try re-initializing the SDK.\n  -5(ERR_REFUSED): The request is rejected. This may be caused by the following:\n      You have created an AgoraRtcChannel object with the same channel name.\n      You have joined and published a stream in an AgoraRtcChannel channel created by the AgoraRtcChannel object.\n  -7(ERR_NOT_INITIALIZED): The SDK is not initialized before calling this method. Initialize the AgoraRtcEngine instance before calling this method."
}