{
    "id": "class_channelmediarelayconfiguration",
    "name": "ChannelMediaRelayConfiguration",
    "description": "The definition of ChannelMediaRelayConfiguration.",
    "parameters": [
        {
            "srcInfo": "\n                        Pointer to the information of the source channel ChannelMediaInfo. It contains the following members:\n                                channelName: The name of the source channel. The default value is null, which means the SDK applies the name of the current channel.\n                                uid: The unique ID to identify the relay stream in the source channel. The default value is 0, which means the SDK generates a random UID. You must set it as 0.\n                                token: The token for joining the source channel. It is generated with the channelName and uid you set in srcInfo.\n                                        If you have not enabled the App Certificate, set this parameter as the default value null, which means the SDK applies the App ID.\n                                        If you have enabled the App Certificate, you must use the token generated with the channelName and uid, and the uid must be set as 0.\n                                    \n                                \n                            \n                        \n                    "
        },
        {
            "destInfos": "\n                        Pointer to the information of the destination channelChannelMediaInfo. It contains the following members:\n                                channelName: The name of the destination channel.\n                                uid: The unique ID to identify the relay stream in the destination channel. The value ranges from 0 to (232-1). To avoid UID conflicts, this uid must be different from any other uid in the destination channel. The default value is 0, which means the SDK generates a random user ID. Do not set this parameter as the user ID of the host in the destination channel, and ensure that this uid is different from any other use ID in the channel.\n                                token: The token for joining the destination channel. It is generated with the channelName and uid you set in destInfos.\n                                        If you have not enabled the App Certificate, set this parameter as the default value null, which means the SDK applies the App ID.\n                                        If you have enabled the App Certificate, you must use the token generated with the channelName and uid.\n                                    \n                                \n                            \n                        \n                    "
        },
        {
            "destCount": "The number of destination channels. The default value is 0, and the value range is from 0 to 4. Ensure that the value of this parameter corresponds to the number of ChannelMediaInfo structs you define in destInfos."
        }
    ],
    "returns": ""
}