{
    "id": "class_screencaptureparameters",
    "name": "ScreenCaptureParameters",
    "description": "Screen sharing configurations.",
    "parameters": [
        {
            "dimensions": "The maximum dimensions of encoding the shared region. See VideoDimensions. The default value is 1920 x 1080, that is, 2,073,600 pixels. Agora uses the value of this parameter to calculate the charges.\n                        If the screen dimensions are different from the value of this parameter, Agora applies the following strategies for encoding. Suppose dimensions are set to 1920 x 1080:\n                                If the value of the screen dimensions is lower than that of dimensions, for example, 1000 x 1000 pixels, the SDK uses 1000 x 1000 pixels for encoding.\n                                If the value of the screen dimensions is higher than that of dimensions, for example, 2000 x 1500, the SDK uses the maximum value next to 1920 x 1080 with the aspect ratio of the screen dimension (4:3) for encoding, that is, 1440 x 1080.\n                            \n                    "
        },
        {
            "frameRate": "The frame rate (fps) of the shared region. The default value is 5. Agora does not recommend setting it to a value greater than 15."
        },
        {
            "bitrate": "The bitrate (Kbps) of the shared region. The default value is 0, which represents that the SDK works out a bitrate according to the dimensions of the current screen."
        },
        {
            "captureMouseCursor": "\n                        \n                            \n                                Since\n                                v2.4.1\n                            \n                        \n                        Sets whether to capture the mouse in screen sharing:\n                                true: (Default) Capture the mouse.\n                                false: Do not capture the mouse.\n                            "
        },
        {
            "windowFocus": "\n                        \n                            Since\n                            v3.1.0\n                        \n                    Sets whether to bring the window to the front when calling the startScreenCaptureByWindow method to share it:\n                            true: Bring the window to the front.\n                            false: (Default) Do not bring the window to the front.\n                        "
        },
        {
            "excludeWindowList": "\n                        \n                            \n                                Since\n                                v3.1.0\n                            \n                        \n                        The ID list of the windows to be blocked. When calling  to start screen sharing, you can use this parameter to block a specified window. When calling updateScreenCaptureParameters to update screen sharing configurations, you can use this parameter to dynamically block a specified window."
        }
    ],
    "returns": ""
}