{
    "id": "class_localvideostats",
    "name": "LocalVideoStats",
    "description": "The statistics of the local video stream.",
    "parameters": [
        {
            "sentBitrate": "\n      The actual bitrate (Kbps) while sending the local video stream.This value does not include the bitrate while resending the video after packet loss.\n  "
        },
        {
            "sentFrameRate": "The actual frame rate (Kbps) while sending the local video stream.This value does not include the frame rate while resending the video after packet loss."
        },
        {
            "encoderOutputFrameRate": "The output frame rate (fps) of the local video encoder."
        },
        {
            "rendererOutputFrameRate": "The output frame rate (fps) of the local video renderer."
        },
        {
            "targetBitrate": "The target bitrate (Kbps) of the current encoder. This is an estimate made by the SDK based on the current network conditions."
        },
        {
            "targetFrameRate": "The target frame rate (fps) of the current encoder."
        },
        {
            "qualityAdaptIndication": "Quality adaption of the local video stream in the reported interval (in terms of the target frame rate and target bitrate). See QUALITY_ADAPT_INDICATION."
        },
        {
            "encodedBitrate": "\n      The bitrate (Kbps) while encoding the local video stream.This value does not include the bitrate while resending the video after packet loss.\n  "
        },
        {
            "encodedFrameWidth": "The width of the encoded video (px)."
        },
        {
            "encodedFrameHeight": "The height of the encoded video (px)."
        },
        {
            "encodedFrameCount": "The number of sent video frames, represented by an aggregate value."
        },
        {
            "CodecType: Encoding type of the sent audio.": "The codec type of the local video stream. See VIDEO_CODEC_TYPE."
        },
        {
            "txPacketLossRate": "The video packet loss rate (%) from the local client to the Agora edge server before applying the anti-packet loss strategies."
        },
        {
            "captureFrameRate": "The capture frame rate (fps) of the local video stream."
        },
        {
            "captureBrightnessLevel": "\n      \n \n     Since\n     v3.3.0\n \n      \n      The brightness level of the video image captured by the local camera. See CAPTURE_BRIGHTNESS_LEVEL_TYPE.\n  "
        }
    ],
    "returns": ""
}