{
    "id": "class_datastreamconfig",
    "name": "DataStreamConfig",
    "description": "The configurations for the data stream.The following table shows the SDK behaviors under different parameter settings:\n   \n       \n  \n  \n  \n           \n               \n                   syncWithAudio\n                   ordered\n                   SDK behaviors\n               \n           \n           \n      \n false\n false\n The SDK triggers the STREAM_MESSAGE callback immediately after the receiver receives a data packet.\n      \n      \n true\n false\n If the data packet delay is within the audio delay, the SDK triggers the STREAM_MESSAGE callback when the synchronized audio packet is played out. If the data packet delay exceeds the audio delay, the SDK triggers the STREAM_MESSAGE callback as soon as the data packet is received.\n      \n      \n false\n true\n In this case, the data packet is not synchronized with the audio packet. If the delay of a data packet is within five seconds, the SDK corrects the order of the data packet.\n      \n      \n true\n true\n If the delay of a data packet exceeds five seconds, the SDK discards the data packet. If the delay of a data packet exceeds the audio delay, the SDK discards this data packet.",
    "parameters": [
        {
            "syncWithAudio": "\n                        Whether to synchronize the data packet with the published audio packet.\n                                true: Synchronize the data packet with the audio\n                                    packet.\n                                false: Do not synchronize the data packet with\n                                    the audio packet.\n                            When you set the data packet to synchronize with the audio, then if\n                            the data packet delay is within the audio delay, the SDK triggers the\n                                STREAM_MESSAGE callback when the synchronized\n                            audio packet is played out. Do not set this parameter as true if you need the receiver to receive the data packet\n                            immediately. Agora recommends that you set this parameter to true only when you need to implement specific functions,\n                            for example lyric synchronization.\n                    "
        },
        {
            "ordered": "\n                        Whether the SDK guarantees that the receiver receives the data in the sent order.\n                                true: Guarantee that the receiver receives the data in the sent order.\n                                false: Do not guarantee that the receiver receives the data in the sent order.\n                            Do not set this parameter as true if you need the receiver to receive the data packet immediately.\n                    "
        }
    ],
    "returns": ""
}